[
    {
        "id": 0,
        "title": "COVID-19 vaccine could be approved and available to public within six months: Poll",
        "content": "The global spread of the COVID-19 pandemic and the resulting economic impact and public health burden has highlighted the urgent need for a vaccine to prevent the disease. The challenges associated with rapidly developing and producing a vaccine at a large scale are, however, enormous.Verdict has conducted a poll to assess the time that could be taken for the approval of a COVID-19 vaccine and its availability to the public.Analysis of the results shows a high chance for an approved COVID-19 vaccine to be available over the next six months, as opined by a majority 36% of the poll respondents, whereas 28% of the respondents feel it could take six to 12 months for the same.Less than one-fourth (22%) of the poll respondents opined that the approval and availability of a COVID-19 vaccine could take between 12 and 18 months, while 14% felt that it could take more than 18 months."
    },
    {
        "id": 1,
        "title": "FDA offers guidance for Covid-19 vaccine development",
        "content": "The US Food and Drug Administration (FDA) has released guidance with recommendations for the manufacturing, clinical development and approval of a Covid-19 vaccine. While the development and review processes are being accelerated to address the ongoing pandemic, the FDA will require data to be submitted to meet its regulatory standards. Named Development and Licensure of Vaccines to Prevent Covid-19, the guidance covers requirements for chemistry, manufacturing and control, nonclinical and clinical data. This includes development and licensure, as well as post-licensure safety evaluation. FDA Commissioner Stephen Hahn noted: “While the FDA is committed to expediting this work, we will not cut corners in our decisions and are making clear through this guidance what data should be submitted to meet our regulatory standards.” For clinical trials, the regulator calls for the recruitment of diverse populations in all phases of development, including racial and ethnic minorities, elderly and people with comorbidities. The FDA guidance also recommended studies to capture data on the use of vaccine during pregnancy, along with safety and effectiveness evaluation in the paediatric population. Furthermore, the sizes of clinical trials should be large enough to validate the safety and effectiveness of a vaccine, expected to prevent disease or mitigate its severity in at least 50% of people vaccinated."
    },
    {
        "id": 2,
        "title": "Few employees want to return to office full-time when lockdowns are eased: Poll",
        "content": "Remote working or working from home has become the new norm during the COVID-19 times which call for maintaining physical distancing and complying with lockdown measures to curb disease spread. Working from home has multiple benefits such as eliminating the need to travel and ensuring business continuity for firms during lockdowns. The world has never seen before such a wide work from home practice implemented across industries, which will have long-term business implications. Verdict is running a poll across its network of sites to assess whether employees want to return to offices after the lockdown restrictions are eased. Analysis of the ongoing poll results so far shows that majority of the respondents want a mix of working remotely and returning to office premises. A majority 46% of the respondents voted for a mix of working remotely and returning to office, while 27% of the respondents wanted to work remotely full-time. Another 27% of the respondents wanted to return to work premises full time. Interestingly, a majority 45% of those who are working from home for the first time wished for a mix of working remotely and in-office given a choice, while 34% wanted to return to office premises full-time and 21% wanted to work remotely full-time, indicating a strong desire to work from home."  
    },
    {
        "id": 3,
        "title": "Oxford Covid-19 vaccine doses improve immune response in animals",
        "content": "A study conducted by the Pirbright Institute, in alliance with the University of Oxford, has demonstrated that two doses of the ChAdOx1 nCoV-19 (AZD1222) Covid-19 vaccine boost antibody response in pigs, compared to a single dose. Phase 1 clinical trials of the single-dose vaccine are underway after preclinical research showed that the product could protect macaques against lung disease following a single immunisation. Currently, participants are being enrolled for the next phase of human trials, with the hope that an effective vaccine could be generated later this year. The Pirbright studies were intended to determine if two doses – prime and boost – of the new vaccine trigger a greater immune response in pigs. An enhanced immune response is set to offer improved protection against the disease. According to the study findings, two ChAdOx1 nCoV-19 vaccine doses induce a significantly greater antibody response in pigs, with a significant rise in neutralising antibodies that bind to the virus and block infection."
    }
]